var store = [{
        "title": "华为的技术资料是如何打造出来的?",
        "excerpt":"昨天下午，前华为翻译中心南京分部经理、华为 2012 实验室南研分部部长张建农先生做客 2020 年中国技术传播论坛，分享了华为在技术写作和技术翻译方面的诸多实践经验，也为技术写作和技术翻译方面的从业者指明了努力方向。 技术写作和技术翻译是一个岗位吗? 在华为，这是两个彼此独立但经常通力合作的部门。 技术写作人员，又叫技术文档工程师或 Technical Writer，大多具有理工科专业背景（比如通信专业），负责撰写技术资料的中文版本或英文版本。 早年，技术写作人员归属于技术资料部，现已被分拆到各个产品线的研发团队。市场的发展与竞争，使产品研发周期从 2 年左右缩短到 1~2 个月。分拆的目的，主要是为了加强技术写作人员与研发人员的协同合作。 技术翻译人员，大多具有语言专业背景，负责将中文版的技术资料翻译成英文，或者将英文版的技术资料翻译成其他语种（120 多种语言）。 华为的技术资料一般使用中文起稿撰写，然后将中文版翻译成英文版，再由英文版翻译成其他语种。这也是目前国内厂商普遍采用的流程。 flowchart LR A(中文版)--&gt;B(英文版) B(英文版)--&gt;C(其他语种) 和技术写作团队不同，技术翻译部门在华为经历的是一个完成相反的历程。最初技术翻译人员是编制在各个产品线上的。2008 年以后，收拢成立华为翻译中心，作为独立核算的实体进行运营。 很多国外企业使用英文起稿撰写，然后将其翻译成其他语种。这种方式，显然会降低翻译成本，但对技术写作人员的要求更高。 实际上，即使采用英文起稿，这些工作也是大多交由国外的技术文档团队完成，或者公司团队中的外籍技术写作人员（成本又上去了）。 华为现在正在对这种方式进行试点，但全面实施尚有难度。 为什么不直接从中文版翻译成其他语种? 因为具备如此能力的翻译人员太难找了！ 中国学生在中学时期一般学英语。小语种专业的学生也是从大学才开始学起的。到毕业时，小语种专业的学生也只学了 4 年左右，实在难以胜任此类工作。 想想看，有多少学生学了 10 年英语还存在阅读困难的！ 工作流程是什么样的? 技术写作和技术翻译都必须遵循华为的集成产品开发流程，即 IPD 流程。 项目伊始，技术写作人员和技术翻译人员便参与到客户的需求分析流程中，从项目文件中提取相关标准、术语规范等，综合考虑华为公司标准以及相关国际标准后制定出项目标准。 技术资料的写作和翻译过程，均采用软件开发中常用的敏捷开发和迭代开发方法，小批快翻，快速迭代，快速响应，与研发进程保持同步。 对技术资料进行翻译前，必须进行原文质量检查（入口检查）。如果原文质量差，译文的质量只能更差。 检查的依据，就是项目开始时制定出的项目标准，比如 Style Guide。如果原文中存在与标准不符的地方，译员便可将其退回给原作者（技术写作人员）修改。 如果技术写作人员确实很忙，译员也会帮忙修改。但这种情况非常少见。 因为华为翻译中心是独立核算的，译员帮的忙是收费项目。被帮忙的员工要拿着收费清单，报主管批准才行（通常，主管很不乐意批这种单子）。 翻译完成的技术资料，要进行测试验证后才能发布。测试验证可以交由其他部门来做，比如研发人员、测试人员、技术写作人员。 其实这里对各个部门的人员提出了一个隐含的要求： 每个岗位的员工只掌握自己岗位的专业知识的不够的，还需要对关联岗位的专业技能也有所涉猎。...","categories": [],
        "tags": ["技术写作"],
        "url": "/2020/12/29/how-does-huawei-produce-their-technical-documentation.html",
        "teaser": null
      },{
        "title": "技术传播职业认证，了解一下?",
        "excerpt":"技术写作，早在 20 世纪 50 年代初就引起美国工业界的重视（尤其是航空、军工、电子和生产制造领域），并且出现了专门致力于发展技术传播的组织。 之后经过 50 多年的发展，尤其是 2000 年以后计算机软件对在线技术文档的需求急剧增加，Technical Writer 的职业影响力显著提升。 2009 年，Technical Writer 被美国劳工统计局认定为独立的职业类别，列为美国劳工部的就业数据统计门类之一。 本文基于中国技术传播大会上一位嘉宾的分享，经过资料再确认和再收集后重新编辑而成。但这位嘉宾并未在直播时透露自己的身份。 技术传播发展现状 Technical Writer 是指编写技术资料的专业人员，包括但不限于产品手册、操作手册、维修手册、参考手册等。 Technical Writer 在国内一般叫做技术文档工程师。遗憾的是，直到现在这个工种都没有取得国家认可的专业类别。 按照美国劳工统计局的数据，2019 年美国共有 5.8 万名技术写作从业者，大多具有本科以上学历，年薪中位数将近 7.3 万美元（约合 47 万元人民币），平均从业经验在 5 年以内。 数据来源：STC薪资数据库（2018-2019） 数据来源：STC薪资数据库（2018-2019） 从 2014-2018 年的从业人数和薪资增长幅度来看，技术写作目前在美国处于平稳发展期，从业人员数量和薪资水平都是缓慢增长的状态。 与其他媒体类岗位相比，技术写作的从业人数不算多（和翻译人员、作家差不多），但薪资水平在这里面却是最高的。 数据来源：STC薪资数据库（2018-2019） 技术写作从业者的年薪中位数比年薪平均值低 5% 左右，表明各个薪资水平上的人员分布呈正偏态分布。也就是说，高薪段的从业人员数量较多。 技术传播教育体系 美国高校早在 1958 年就开始开设技术传播（Technical Communication）专业，现在全美已经有几百个技术传播专业的学位项目，本硕博全都有。 美国的学位有两种：Undergraduate...","categories": [],
        "tags": ["职业发展"],
        "url": "/2020/12/31/certificated-professional-technical-communicator.html",
        "teaser": null
      },{
        "title": "全球大厂的技术文档写作指南们！",
        "excerpt":"产品文档最讲究两点：简明扼要，文风一致。 “简明扼要”尚可依仗技术写作人员的专业能力来实现，可“文风一致”怎么做到呢? 靠技术写作人员的个人感觉吗? 如果产品文档需要多人共同完成，怎样办? 答案是：标准化。参与文档编写的所有人员，遵循统一的标准来进行写作。这个标准，叫做技术文档写作指南（editorial style guides for technical writing）。 写作指南里，可以规定写作原则、术语库、标题和缩略语的写法、标点符号的使用方法、单位的使用方法、无障碍阅读设计原则、以及跨设备阅读设计原则等方方面面的内容。 有了写作指南，技术写作人员在写作时就有章可循、有规可守，即使多人协作也能“异口同声”。 有些行业推行业内通用的技术文档写作指南，比如航空业的 ASD-STE100 。但大多数行业没有统一标准，需要企业自行编写。 还没有自己的技术文档写作指南? 别愁！虽然编写作指南的难度系数很高，但你完全不需要从零开始。 很多“个高”的公司（比如微软、谷歌、苹果），不仅编写出了优质的技术文档写作指南，实时维护，还把它们免费公开了！ 虽然你可能属于不同的行业，但这些写作指南里的很多写作原则却是通用的，而且已经被广泛验证过。 如果这些还不够，文末还有更权威、更详尽的泰斗级写作指南作后盾呢！ ASD-STE100 ASD-STE100 起源于航空航天业和国防部门，是专门为了降低操作手册和维修手册的阅读难度而编写的一种英语语言规范。 在很多领域里，英语是使用率最高的国际通用语言。但对于很多人来说，英语并非母语，很难读懂手册里的多义词、生僻单词、俗语、以及结构复杂的长句子。 一旦飞行员、维修工程师、培训人员等工作人员对手册里的操作规范理解有误，进行了不正当操作，势必会危及全体乘客的生命安全。 正是基于这种需求，欧洲航空航天和国防工业协会（ASD）联合美国航空航天工业协会（AIA）共同调研并编制了 ASD-STE100。 ASD-STE100 要求在手册中使用简洁的语言向读者传递准确、不包含歧义的信息。它由两大部分构成：写作原则和受控词库。 ASD-STE100 不涉及格式、标点符号、缩略语、单位等内容，只能作为技术文档写作指南的一部分，并不能独立使用。 目前，ASD-STE100 的使用范围已经远远超出了航空航天业，在很多行业中推广开来。 官方渠道：前往 ASD-STE100 官网下载申请表，填好后发送至 stemg@asd-ste100.org。之后，工作人员会将 PDF 版 ASD-STE100 免费发送到你的邮箱。 IBM 技术文档写作指南 这是 IBM 于 2011 年出版的技术文档写作指南，堪称技术写作的教科书。 这里面，英语语法、标点符号、文档架构、单位、格式、词汇表等写作指南的标准构件一应俱全。 难能可贵的是，这本书不仅给出了这些元素的基本概念，还现身说法——为每一条写作原则提供写作实例和讲解。很多技术写作人员把它当成技术写作的入门必备教材。...","categories": [],
        "tags": ["学习资源"],
        "url": "/2021/06/25/top-10-editorial-style-guides-for-technical-writing.html",
        "teaser": null
      },{
        "title": "我的GitHub资源库：神奇的技术写作研习路",
        "excerpt":"引言      标题   标题   标题   标题      [!TIP] 这是一条提示信息。    标题   正文   标题   正文  ","categories": [],
        "tags": [],
        "url": "/2024/04/25/awesome-technical-writing-learning.html",
        "teaser": null
      }]
