var store = [{
        "title": "华为的技术资料是如何打造出来的?",
        "excerpt":"昨天下午，前华为翻译中心南京分部经理、华为 2012 实验室南研分部部长张建农先生做客 2020 年中国技术传播论坛，分享了华为在技术写作和技术翻译方面的诸多实践经验，也为技术写作和技术翻译方面的从业者指明了努力方向。 技术写作和技术翻译是一个岗位吗? 在华为，这是两个彼此独立但经常通力合作的部门。 技术写作人员，又叫技术文档工程师或 Technical Writer，大多具有理工科专业背景（比如通信专业），负责撰写技术资料的中文版本或英文版本。 早年，技术写作人员归属于技术资料部，现已被分拆到各个产品线的研发团队。市场的发展与竞争，使产品研发周期从 2 年左右缩短到 1~2 个月。分拆的目的，主要是为了加强技术写作人员与研发人员的协同合作。 技术翻译人员，大多具有语言专业背景，负责将中文版的技术资料翻译成英文，或者将英文版的技术资料翻译成其他语种（120 多种语言）。 华为的技术资料一般使用中文起稿撰写，然后将中文版翻译成英文版，再由英文版翻译成其他语种。这也是目前国内厂商普遍采用的流程。 flowchart LR A(中文版)--&gt;B(英文版) B(英文版)--&gt;C(其他语种) 和技术写作团队不同，技术翻译部门在华为经历的是一个完成相反的历程。最初技术翻译人员是编制在各个产品线上的。2008 年以后，收拢成立华为翻译中心，作为独立核算的实体进行运营。 很多国外企业使用英文起稿撰写，然后将其翻译成其他语种。这种方式，显然会降低翻译成本，但对技术写作人员的要求更高。 实际上，即使采用英文起稿，这些工作也是大多交由国外的技术文档团队完成，或者公司团队中的外籍技术写作人员（成本又上去了）。 华为现在正在对这种方式进行试点，但全面实施尚有难度。 为什么不直接从中文版翻译成其他语种? 因为具备如此能力的翻译人员太难找了！ 中国学生在中学时期一般学英语。小语种专业的学生也是从大学才开始学起的。到毕业时，小语种专业的学生也只学了 4 年左右，实在难以胜任此类工作。 想想看，有多少学生学了 10 年英语还存在阅读困难的！ 工作流程是什么样的? 技术写作和技术翻译都必须遵循华为的集成产品开发流程，即 IPD 流程。 项目伊始，技术写作人员和技术翻译人员便参与到客户的需求分析流程中，从项目文件中提取相关标准、术语规范等，综合考虑华为公司标准以及相关国际标准后制定出项目标准。 技术资料的写作和翻译过程，均采用软件开发中常用的敏捷开发和迭代开发方法，小批快翻，快速迭代，快速响应，与研发进程保持同步。 对技术资料进行翻译前，必须进行原文质量检查（入口检查）。如果原文质量差，译文的质量只能更差。 检查的依据，就是项目开始时制定出的项目标准，比如 Style Guide。如果原文中存在与标准不符的地方，译员便可将其退回给原作者（技术写作人员）修改。 如果技术写作人员确实很忙，译员也会帮忙修改。但这种情况非常少见。 因为华为翻译中心是独立核算的，译员帮的忙是收费项目。被帮忙的员工要拿着收费清单，报主管批准才行（通常，主管很不乐意批这种单子）。 翻译完成的技术资料，要进行测试验证后才能发布。测试验证可以交由其他部门来做，比如研发人员、测试人员、技术写作人员。 其实这里对各个部门的人员提出了一个隐含的要求： 每个岗位的员工只掌握自己岗位的专业知识的不够的，还需要对关联岗位的专业技能也有所涉猎。...","categories": [],
        "tags": ["技术写作"],
        "url": "/2020/12/29/how-does-huawei-produce-their-technical-documentation.html",
        "teaser": null
      },{
        "title": "技术传播职业认证，了解一下?",
        "excerpt":"技术写作，早在 20 世纪 50 年代初就引起美国工业界的重视（尤其是航空、军工、电子和生产制造领域），并且出现了专门致力于发展技术传播的组织。 之后经过 50 多年的发展，尤其是 2000 年以后计算机软件对在线技术文档的需求急剧增加，Technical Writer 的职业影响力显著提升。 2009 年，Technical Writer 被美国劳工统计局认定为独立的职业类别，列为美国劳工部的就业数据统计门类之一。 本文基于中国技术传播大会上一位嘉宾的分享，经过资料再确认和再收集后重新编辑而成。但这位嘉宾并未在直播时透露自己的身份。 技术传播发展现状 Technical Writer 是指编写技术资料的专业人员，包括但不限于产品手册、操作手册、维修手册、参考手册等。 Technical Writer 在国内一般叫做技术文档工程师。遗憾的是，直到现在这个工种都没有取得国家认可的专业类别。 按照美国劳工统计局的数据，2019 年美国共有 5.8 万名技术写作从业者，大多具有本科以上学历，年薪中位数将近 7.3 万美元（约合 47 万元人民币），平均从业经验在 5 年以内。 数据来源：STC薪资数据库（2018-2019） 数据来源：STC薪资数据库（2018-2019） 从 2014-2018 年的从业人数和薪资增长幅度来看，技术写作目前在美国处于平稳发展期，从业人员数量和薪资水平都是缓慢增长的状态。 与其他媒体类岗位相比，技术写作的从业人数不算多（和翻译人员、作家差不多），但薪资水平在这里面却是最高的。 数据来源：STC薪资数据库（2018-2019） 技术写作从业者的年薪中位数比年薪平均值低 5% 左右，表明各个薪资水平上的人员分布呈正偏态分布。也就是说，高薪段的从业人员数量较多。 技术传播教育体系 美国高校早在 1958 年就开始开设技术传播（Technical Communication）专业，现在全美已经有几百个技术传播专业的学位项目，本硕博全都有。 美国的学位有两种：Undergraduate...","categories": [],
        "tags": ["职业发展"],
        "url": "/2020/12/31/certificated-professional-technical-communicator.html",
        "teaser": null
      },{
        "title": "全球大厂的技术文档写作指南们！",
        "excerpt":"产品文档最讲究两点：简明扼要，文风一致。 “简明扼要”尚可依仗技术写作人员的专业能力来实现，可“文风一致”怎么做到呢? 靠技术写作人员的个人感觉吗? 如果产品文档需要多人共同完成，怎样办? 答案是：标准化。参与文档编写的所有人员，遵循统一的标准来进行写作。这个标准，叫做技术文档写作指南（editorial style guides for technical writing）。 写作指南里，可以规定写作原则、术语库、标题和缩略语的写法、标点符号的使用方法、单位的使用方法、无障碍阅读设计原则、以及跨设备阅读设计原则等方方面面的内容。 有了写作指南，技术写作人员在写作时就有章可循、有规可守，即使多人协作也能“异口同声”。 有些行业推行业内通用的技术文档写作指南，比如航空业的 ASD-STE100 。但大多数行业没有统一标准，需要企业自行编写。 还没有自己的技术文档写作指南? 别愁！虽然编写作指南的难度系数很高，但你完全不需要从零开始。 很多“个高”的公司（比如微软、谷歌、苹果），不仅编写出了优质的技术文档写作指南，实时维护，还把它们免费公开了！ 虽然你可能属于不同的行业，但这些写作指南里的很多写作原则却是通用的，而且已经被广泛验证过。 如果这些还不够，文末还有更权威、更详尽的泰斗级写作指南作后盾呢！ ASD-STE100 ASD-STE100 起源于航空航天业和国防部门，是专门为了降低操作手册和维修手册的阅读难度而编写的一种英语语言规范。 在很多领域里，英语是使用率最高的国际通用语言。但对于很多人来说，英语并非母语，很难读懂手册里的多义词、生僻单词、俗语、以及结构复杂的长句子。 一旦飞行员、维修工程师、培训人员等工作人员对手册里的操作规范理解有误，进行了不正当操作，势必会危及全体乘客的生命安全。 正是基于这种需求，欧洲航空航天和国防工业协会（ASD）联合美国航空航天工业协会（AIA）共同调研并编制了 ASD-STE100。 ASD-STE100 要求在手册中使用简洁的语言向读者传递准确、不包含歧义的信息。它由两大部分构成：写作原则和受控词库。 ASD-STE100 不涉及格式、标点符号、缩略语、单位等内容，只能作为技术文档写作指南的一部分，并不能独立使用。 目前，ASD-STE100 的使用范围已经远远超出了航空航天业，在很多行业中推广开来。 官方渠道：前往 ASD-STE100 官网下载申请表，填好后发送至 stemg@asd-ste100.org。之后，工作人员会将 PDF 版 ASD-STE100 免费发送到你的邮箱。 IBM 技术文档写作指南 这是 IBM 于 2011 年出版的技术文档写作指南，堪称技术写作的教科书。 这里面，英语语法、标点符号、文档架构、单位、格式、词汇表等写作指南的标准构件一应俱全。 难能可贵的是，这本书不仅给出了这些元素的基本概念，还现身说法——为每一条写作原则提供写作实例和讲解。很多技术写作人员把它当成技术写作的入门必备教材。...","categories": [],
        "tags": ["学习资源"],
        "url": "/2021/06/25/top-10-editorial-style-guides-for-technical-writing.html",
        "teaser": null
      },{
        "title": "被称为“国之重器”的工业巨无霸们，为啥对婆婆妈妈的 S1000D 青睐有加?",
        "excerpt":"在年初的 tcworld 中国大会上，我做了一场题为《道阻且长：在高端装备制造业中实现技术文档高质量交付的实践与思考》的演讲。 在那次演讲中，我以一个欧美地铁列车项目为例，详细介绍了高端装备制造业中技术文档的交付要求和交付流程，并且还分享了项目中遇到的难点和痛点： 必须按照客户的要求（合同条款）编制，可回旋的余地很小。 内容的专业性特别强，对供应商手册进行内容整合的难度很大。 项目周期特别长，进度难以把控，管理难度大。 针对这些问题，虽然我进行过很多思考，但都不足以从根本上解决问题。 最近，我有机会和一位航空航天方面的同行聊了聊 S1000D，并借机向他了解了一下 S1000D 在轨道交通行业的应用情况。 实际上，我在演讲中提到的这些难点和痛点，也同样困扰着那些在国际市场上声名显赫的轨道交通装备制造商们。 早在 2013 年，法国轨道交通装备制造商阿尔斯通 (ALSTOM)、加拿大交通运输设备制造商庞巴迪 (Bombardier) 和法国国营铁路公司 (SNCF) 就曾联合成立了一个指导委员会和工作组。 他们希望能像海运业一样，基于 S1000D 制定出一套行业通用的数据交换协议 (RailDex)，使运营商（铁路公司、地铁公司等）、制造商和供应商可以遵循统一的规范来编制手册及其相关文档，以最大限度地减少各方在信息互通互用方面的成本。 海运业中通用的数据交换协议叫 Shipdex，首版发布于 2008 年。 Shipdex 使船东、造船厂、修船厂、船级社等都使用统一的规范编写手册及相关文档，以最大限度地减少各方在信息互通互用方面的成本。 虽然 RailDex 后来非常遗憾地无疾而终了，但 S1000D 在轨道交通行业仍然是备受青睐的技术文档编制规范。只是大家在具体实施的时候各自为政罢了，不像航空航天和海运业那样在整个行业内实现了大一统。 航空航天、船舶工程以及轨道交通装备都是以产品复杂度高、专业性强和产品使用寿命长而著称的行业。为什么这些行业都对 S1000D 青睐有加? S1000 到底有何独特之处? 本文将从一个技术文档工程师的角度细说原委，希望能为那些对 S1000D 持观望态度的同行和企业提供更进一步的依据和勇气，也为那些没有机会实施 S1000D 但正面临相似困境的小伙伴们提供一些理念上的借鉴和参考。 管理模式 在软件开发中，有两种开发方式经常被放在一起比较：敏捷开发和瀑布模型。敏捷开发通常是时尚、迅捷的代表，而瀑布模型往往以老旧、雍肿的“慢半拍”形象陪衬。 但瀑布模型却和 S1000D...","categories": [],
        "tags": ["文档技术"],
        "url": "/2024/01/09/s1000d-features.html",
        "teaser": null
      },{
        "title": "Sora 并非首个视频生成模型，为何还能一出场就惊艳了所有人?",
        "excerpt":"上周四，OpenAI 发布了首个视频生成模型 Sora。栩栩如生的高清视频让众多网友惊呼“真假难辨，以后连视频证据都不可信了吧”！ 作为一个正对视频号跃跃欲试的技术传播小号主，自然知道视频制作的门槛。之前，哪怕只是想做个好一点的动图，也需要花好长时间。每次动手前，我都得进行一下心理建设！ 对于像我这样的业余选手来说，“龙年一开年，Sora 霸屏了”绝对是个好消息。 本文将从一个普通群众的角度总结一下 Sora 及其竞品的功能特性，从而更全面地展现人工智能在视频制作领域的发展现状，说不定能帮助很多像我一样的小伙伴挑选到更顺手的工具呢！ Sora 根据 OpenAI 的技术报告，Sora 可以根据用户输入的提示词、图片和视频等素材自动生成视频。 Sora 生成的视频最长可达一分钟，视频尺寸可以是 1920×1080p（宽屏）、1080×1920p（竖屏）以及二者之间的任意尺寸。也就是说，Sora 可以直接生成可在各种设备上播放的视频，无需后续编辑。 如果你想观看视频样片，请移步 OpenAI 官网：《Sora 简介》和《Sora 官方技术报告》 除了自动生成视频，Sora 还可以生成图片、编辑图片和视频。 图片可以被视为单帧视频。Sora 可以生成任意尺寸的图片，分辨率最高可达 2048×2048。 如果你给 Sora 输入图片和提示词，它能按照提示词将图片变成视频。 如果你给 Sora 输入视频和提示词，它能按照提示词为视频添加片头或片尾、变换视频风格或者将视频无缝拼接在一起。 目前，Sora 还没有对公众开放。但 OpenAI 已经邀请红队成员、视觉艺术家、设计师和电影制作人等各领域的专业人士试用 Sora，以评估关键领域的危害和风险，为后续的改进和完善模型收集专业的反馈意见。 红队是网络安全中的术语，指通过模拟真实的攻击手法测试和评估系统弱点的安全专家团队。 其他视频生成模型 Sora 并不是地球上的首个视频生成模型。OpenAI 发布 Sora 之前，Runway AI、Stability AI、 MoonValley AI...","categories": [],
        "tags": ["文档技术"],
        "url": "/2024/02/20/Sora-and-similar-applications.html",
        "teaser": null
      },{
        "title": "使用国产AI大模型“猜写”BBC科技文章《走进说明书的世界》",
        "excerpt":"前段时间，我无意间搜到一篇来自 BBC Future 的科技文章《走进说明书的世界》(Inside the World of Instruction Manuals)。 我非常想看这篇文章，但国内无法访问 BBC 官网。在好奇心的驱使下，我非常幸运地找到了一期诵读这篇文章的播客。 由于咱们大都能猜到的原因（英语听力不如阅读理解能力好），我尝试把这期播客的音频转换成文本，方便以后随时查阅。 我用语音识别软件将播客的音频文件转换成了文本，但文本中存在很多错误。例如，很多单词的拼写不对或者写成了发音相似的单词，很多标点符号的后面没有插入空格，很多地方存在错误断句（一词一句现象很多），等等。 从音频转换而来的初稿 我用有道云笔记中的语音速记转换了一小半，免费额度就用完了。剩下的部分，我使用的是搜狗输入法的语音输入。总体来说，有道云笔记的语音速记比搜狗输入法的语音输入转换的效果要好一些。 不过我今天刚发现，阿里的通义听悟转换得又快又好，还免费。如果早一点发现，就不需要做后面的事情了。 刚开始，我听着音频手动修改这些错误。听一遍音频，改一处错误。改好一个句子需要听好几遍音频。实在是太慢了！ 第二天，我突然开窍了：为什么不用 AI 大模型试试呢?！这一试不要紧，好像发现了新大陆。我一下子从苦工变成了监工，身心解放了（阶层跃迁了一丢丢）！ 本文将展示我用来整理这些杂乱文本的分步计划和提示词，分析大模型的处理结果，并随机总结国产 AI 大模型目前的一些基本情况。希望这篇文章能抛砖引玉，启发你在更多的应用场景下想到 AI 大模型，或者在使用 AI 大模型时萌发更好的解题思路。 分步处理计划 ChatGPT 火爆出圈之后，国内的 AI 大模型们相继于去年下半年向公众开放。目前比较流行的国产大模型有百度的文心一言、阿里云的通义千问、科大讯飞的星火认知大模型、以及百川大模型等。 更多国产 AI 大模型，请参见 Github 存储库《中国大模型列表》。 这些大模型一般对提示词的长度有一定的限制。比如文心一言 3.5 的提示词不能超过 2000 个字符，通义千问的提示词长度不能超过 10000 个字符。 在计算提示词的长度时，汉字、英文字母、数字、标点符号、空格和换行符等都按一个字符计算。也就是说，提示词中的英文内容比较消耗字符数。 据统计，在一篇英文文章中单词的平均长度大约是 5~6 个英文字符。也就是说，文心一言 3.5...","categories": [],
        "tags": ["文档技术"],
        "url": "/2024/03/12/recovery-bbc-article-from-voice-input-draft.html",
        "teaser": null
      },{
        "title": "我也在GitHub上开了一个Awesome系列的资源库：神奇的技术写作研习路",
        "excerpt":"春节前查资料时候，我的浏览器又慢成树懒了。打开收藏夹一看， 果然不出所料，我随手收藏的网页又变成一堆一堆的了。 为什么是“又”? 在改用 Microsoft Edge 之前，我已经用废了一个搜狗浏览器了。 收藏夹塞得满满当当，但启动特别慢。删不得又用不了，所以它至今还在我的电脑桌面上玩葛优躺呢！总不能再装一个浏览器吧? 如果把这些资料的名称、网址以链接的形式收集起来，再分门别类地整理到文件里，每次需要用时只要点链接就好了，岂不是比收藏夹还方便? 要想跨设备同步，只要把文件做成在线文档就行，比如有道云笔记、腾讯文档。 原本我打算在有道云笔记里整理这些资料。可整理到一半的时候，我转念一想：“既然花了这么多时间，为什么不把它们分享出来呢? 可能有人正在查找这些资料呢！如果有人喜欢，还可以一起维护。” 于是，我先调查了一下 GitHub 上技术写作类资源库的大致情况，发现我收藏的资源和分类整理的思路与现有的资源库都不一样。然后，我就创建了一个自己的 GitHub 存储库，还制作了一个小网站。 技术写作类 GitHub 资源库概况 目前，GitHub 上共有 311 个公开存储库标记了 “technical-writing”（话题标签）。按星数 (Star) 排名前十位的存储库中，有 4 个资源（收集）库。 排名第一位的《文档汇编》 (The Documentation Compendium) 以收集代码库中常用的各类文档模板为主，比如 readme 模板、拉取请求模板 (pull requests) 和问题模板 (issues) 等。 其余 3 个都是以收集学习资料为主，但收集的资料种类和对资料的分类方式略有差别。 两个 Awesome 系列的资源库按照资源的类型或媒介形式分类，比如课程、书籍、视频、音频（播客）等。《神奇的技术写作》 (Awesome Technical Writing)...","categories": [],
        "tags": ["学习资源"],
        "url": "/2024/04/23/awesome-technical-writing-learning.html",
        "teaser": null
      },{
        "title": "我的GitHub资源库：神奇的技术写作研习路",
        "excerpt":"引言      标题   标题   标题   标题      [!TIP] 这是一条提示信息。    标题   正文   标题   正文  ","categories": [],
        "tags": [],
        "url": "/2024/04/25/awesome-technical-writing-learning.html",
        "teaser": null
      },{
        "title": "从技术传播角度看，雷军营销“神”在哪?",
        "excerpt":"自从小米汽车在去年年底举行技术发布会以来，有关 CEO 兼主讲人雷军的话题屡屡被送上热搜。雷军的营销方法，不仅受到各路媒体的大力追捧，还引来不少大佬们的艳羡和效仿…… 前有京东创始人刘强东甘拜下风，后有 360 创始人昔日死对头周鸿祎潜心研究雷军行为学。小鹏汽车董事长何小鹏也在北京车展上公开表示，“雷总的营销能力比我强。” 不过，也有网友认为，雷总只是产品做得好、人设立得住，所谓“营销能力强”还不是因为友商们太拉跨?！ 正好，这届北京车展车模都没来，老总们全来了。咱让雷总和其他车企老总一起跑个分，怎么样? 跑分是一种基准程序测试，可以用直观的数据展现设备的综合性能。据说，雷总早年投资安兔兔、Zealer等评测机构，率先将跑分概念引入了手机行业。 虽然人们对跑分褒贬不一，但它胜在简单、直接、可衡量，用在这种众说纷纭、莫衷一是的情形下再合适不过了。 营销界里花活儿多，要测就测基本功。在新媒体时代，无论运营图文内容（如微博、公众号）、视频内容（如抖音、视频号）还是现场发布会，都需要良好的沟通和表达能力。 无论沟通对象是谁，无论要表达什么内容，无论要达成怎样的营销目标，首先得保证对方能听得懂。也就是说，你说的话、写的稿、发的文必须通俗易懂。对于科技企业而言，这一点尤其重要。 本文将从小米汽车北京车展发布会的官方视频中提取雷总的演讲文稿，将其与其他车企的演讲文稿一起进行文本易读性评测。然后根据评测数据分析一下，雷总到底是营销天才还是劳模出圈，希望能为那些艳羡雷总身上泼天流量的人们找点取经之道。 什么是文本易读性? 文本易读性是指阅读文字内容的难易程度。文本易读性好，说明内容通俗易懂，大多数读者能一看就懂。文本易读性差，说明内容晦涩难懂，需要读者具备较高的阅读理解能力。 早在 19 世纪，随着教育的普及和民众识字率的提高，一些欧美学者就意识到了文本易读性的重要性，开始倡导简单清晰的表达方式。 到了 20 世纪初的大萧条时期，成年人的阅读需求激增，但当时的很多书籍都很晦涩，受教育程度不高的人们往往看不懂。 芝加哥大学出版社的两位研究人员调查研究发现，影响书籍易读性的因素主要有四种：内容、写作方式、排版（即格式）和结构（即内容的组织方式）。其中，作者的写作方式对书籍的易读性影响最大，比如选用的词语、句子的平均长度等。 他们将研究成果整理成书，书名叫做《怎样让书籍更好读》(What Makes A Book Readble, 1935)。该书一经出版，立刻在教育界引起了强烈反响，并引来一波研究热潮。 文本易读性评测 在这波热潮里，学界不仅研究如何提高书籍的易读性，还想尽办法设计用来衡量文本易读性的计算公式。 弗雷奇易读性公式 (Flesch Reading Ease) 是产生较早、应用最广泛的易读性公式： \\[206.835 - 1.015 \\times \\frac{单词总数}{句子总数} - 84.6 \\times \\frac{音节总数}{单词总数}\\] 弗雷奇易读性公式只考虑两项指标，句子长度和单词复杂度。计算结果就是易读性得分，分值在 0~100 之间。得分越高，说明易读性越好。 该公式发表在弗雷奇 1949 年出版的《易读性著作的艺术》(The...","categories": [],
        "tags": ["行业八卦"],
        "url": "/2024/05/02/why-leijun-is-so-sucessful-on-marketing-in-tcers-view.html",
        "teaser": null
      },{
        "title": "我该怎样部署内容管理系统，私有化部署还是云服务模式?",
        "excerpt":"一提内容管理系统，准让钱包抖三抖。为啥? 因为它太费钱了，十几万起步，几百万司空见惯。 这么奢华的东西，谁买都得费费神。产品样数多，价格弹性大，买完还得要维护。头疼！ 不久前，美国内容策略咨询公司 CEO 莎姐 (Sarah O’Keefe) 和 Ellucian 公司资深信息架构师帕姐 (Pam Noreault) 一起在 BrightTALK 上开了一场网络研讨会 (Managing Content With Tools Beyond Your Control)。 在研讨会上，她们深入探讨了内容管理系统的主要部署方式、每一种部署方式的优缺点和潜在风险，还在采购决策、软件定制和沟通管理等方面碰撞出了很多实用又独到的见解。 本文是一篇精心整理的笔记，借花献佛。如果你正在挑选内容管理系统，希望它能雪中送炭。如果你已经入手内容管理系统了，希望能引发你的共鸣和分享欲。如果你的日程表上还没有采购内容管理系统这件事，收藏一下，说不定以后有大用处。 部署方式 内容管理系统的部署方式分为两种：私有化部署和云服务模式。 私有化部署 (on-premise)，也叫做本地部署或独立部署，是指将内容管理系统部署在自己可以控制的独立服务器、虚拟主机或云服务器上。 私有化部署的优点是，企业对内容管理系统拥有较高的自主权，可以根据自身需要对系统进行定制开发或二次开发。它的缺点是，系统上线后，企业得自己负责软件维护工作，成本较高。 云服务模式，也叫 SaaS (Software as a Service) 或云部署，是指订阅第三方供应商（即云服务供应商）提供的互联网软件。第三方供应商负责内容管理系统的部署、升级和维护。 云服务模式的优点是，功能丰富，扩展性好，安全可靠，免费更新，无需维护。它的缺点是，企业缺少自主权（比如无法控制软件要不要升级、什么时候升级），故障修复周期长，定制开发的费用高等。 更新和维护 如果采用私有化部署，内容管理系统的更新和维护一般由企业的 IT 部门负责。 按常理来说，内部部门之间沟通起来会比较方便，协同解决问题的效率会比较高。但如果 IT 部门的能力有限，或者企业中的“部门墙”现象比较严重，当你遇到问题或故障时，他们可能不会帮你及时解决。 在研讨会上，莎姐和帕姐让听众投票评价自己公司的 IT 部门。投票结果显示，约 2/3 的人对...","categories": [],
        "tags": ["软件工具"],
        "url": "/2024/05/28/how-to-deploy-content-management-systems.html",
        "teaser": null
      },{
        "title": "逆向追踪『谷歌搜索意外流出2500多页API文档』",
        "excerpt":"近日，谷歌又双叒叕摊上事儿了，还是一份 API 文档惹出来的大事！ 5 月 27 日，两位搜索引擎优化 (SEO) 专家菲哥 (Rand Fishkin) 和王哥 (Mike King) 分别在各自的博客爆料，谷歌搜索意外流出 2500 多页 API 文档。这份内部文档是谷歌云的一份 API 文档，内容涉及谷歌神秘的搜索排名算法。 消息一出，SEO 圈儿立马炸了。大伙儿纷纷赶去围观这份免费的大礼，拜读 SEO 专家的解析文章，热议谷歌是不是又被啪啪打脸了…… 不过，咱对 SEO 知道的不多，就不班门弄斧了。咱从自己的专业角度刨根问底一下，这些个 API 文档到底是怎么从谷歌的眼皮子底下偷偷溜出来的? 难道真是机器人的锅? 面世 5 月 5 日（星期日），菲哥收到一封匿名邮件。在邮件里，爆料人说他手里有谷歌搜索部门的内部文件 —— 多达 2500 页的 API 文档，文档内容与谷歌多年来的公开声明自相矛盾。 菲哥是 SEO 界的大佬，SparkToro 公司的联合创始人和 CEO，自然不会一听就信。他先跟爆料者通了几封邮件，然后在 5 月 24...","categories": [],
        "tags": ["行业八卦"],
        "url": "/2024/06/18/how-google-search-internal-documentation-leaked.html",
        "teaser": null
      },{
        "title": "2017-2024年DITA满意度调查报告",
        "excerpt":"DITA (Darwin Information Typing Architecture) 原是 IBM 的技术文档专家开发的内部标准，2004 年 IBM 将其捐赠给了结构化信息标准促进组织 (OASIS)。 2005 年 6 月 1 日，OASIS 正式发布了 DITA 的首个版本 (1.0 版)。从此之后，DITA 变成了一个开放的标准。 如今，将近 20 年过去了。使用 DITA 的人数仍然在稳步增长，分布区域也越来越广。 那么，DITA 到底给人们带来了怎样的体验? 人们在使用 DITA 的过程中又会经历哪些困难和挑战? 面对这些困难和挑战时，我们又应该怎样克服呢? 带着这些问题，结构化内容服务公司 Precision Content 和 技术传播领域的新媒体公司 Content Wrangler 分别在 2017 年、2020 年和 2024 年进行了三次 DITA 满意度调查。...","categories": [],
        "tags": ["DITA"],
        "url": "/2024/07/23/2024-DITA-satisfaction-report.html",
        "teaser": null
      },{
        "title": "Stack Overflow 年度报告：80% 以上的人使用技术文档学编程",
        "excerpt":"近日，著名的开发者问答社区 Stack Overflow 发布了最新的开发者年度调查报告。该调查于每年 5~6 月份进行，已经持续 14 年了。 今年，共有来自全球 185 个国家的 6.5 万名开发者参与了调查。其中，大约 75% 的参与者是专业程序员，10% 的参与者在工作或学习中涉及编程（虽然他们不是专职程序员），6% 的参与者正在学习编程。 参与者的受教育水平 在所有参与调查的人员中，75% 左右的人拥有专科或以上学历，13% 的人有过大学学习的经历但未达到毕业要求（在读、辍学或结业等），11% 的人处于高中或以下文化水平。 专业程序员的受教育水平相对高一些，80% 左右的人拥有专科或以上学历，只有 6% 的人处于高中或以下文化水平。 非常有趣的是，正在学习编程的人群受教育水平明显偏低。只有 32% 的人拥有专科或以上学历，20% 的人有过大学学习的经历但未达到毕业要求（在读、辍学或结业等），而高中或以下文化水平的人高达 45%。 根据这一群体的年龄数据，23% 的人还未满 18 岁（高中毕业生的年龄大多在 17~18 岁），说明一些正在学习编程的人还是学生，尚未完成学业。但显而易见，学生人数还是远远低于正在学习编程的高中及以下文化水平的总人数。 这或许说明，编程的难度已经没有那么高了。除了编程语言的进步，可能还因为学习资源越来越多、越来越通俗易懂，而且越来越容易获取。 最受欢迎的学习资源 学习编程时，大家最喜欢使用在线资源，其次是书籍、网络课程 (E-courses or Certification) 和线下培训 (school)。 不同的人群对学习资源的偏好有些许差异。正在学习编程的人更加喜欢参加线下培训和网络课程。相比之下，已经有编程经验的人更喜欢看书，在职培训的机会也更多一些。 从按年龄段统计的学习资源数据来看，年纪越轻越喜欢使用在线资源，年纪越大越喜欢看书。25~64 岁的人获得在职培训的机会最多，各年龄段大都在 50% 左右。18~24...","categories": [],
        "tags": ["调查报告"],
        "url": "/2024/08/06/2024-stackoverflow-developer-survey.html",
        "teaser": null
      },{
        "title": "编程小白，借助AI大模型真能摇身一变成为“伪程序员”吗?",
        "excerpt":"近日，北京语言大学高级翻译学院的韩林涛老师利用 AI 大模型和腾讯云的产品文档《云点播开发指南》成功开发出了一种非常实用的交互式英语口语学习工具。 通过这个工具，学生们不仅可以一边看视频，一边练口语，还能通过 AI 评测实时了解练习成绩。更厉害的是，所有的口语练习素材都是依靠 AI 大模型从视频中自动提取的。 听上去很高深吧? 但韩林涛老师坦言，自己其实是实打实的“英语专业出身”，最多只能算个“半路出家的伪程序员”！ “这种级别的伪程序员，也高出普通人十万八千里吧?！” “又是一个喜欢钻研、不断突破自己的人间偶像！” 你是不是也正在这样腹诽呢? 或许这些都对，但绝对没你想的那么遥不可及。 Stack Overflow 的最新调查显示，现在学习编程的人里有将近一半没有接受过高等教育，只有高中或以下文化水平。不管是专业程序员还是尚在学习阶段的新手，都喜欢使用 AI 辅助编程。他们认为，AI 可以大大提高他们的工作效率和学习效率。 去年年底写 2023 年年终总结 时，我决定尝试使用 AI 大模型来提高工作效率。半年多过去了，我发现我用 AI 大模型做得最多的事情也是编程。 除了提高编程速度之外，AI 大模型还让我做到了很多我以前不敢做、做不了的事情。赋能，这或许就是 AI 大模型让我们欲罢不能的根本原因吧！ 借着这个话头，我也来一次现身说法： AI 辅助编程，其实一点也不难。只要你会说话，把你的需要或者你的问题告诉 AI 大模型，不需要多么深厚的编程基础，不需要懂什么提示工程，你就能做很多事情。 接下来，我会介绍几个真实的、高频出现的应用场景。在这些场景里，你只要让 AI 大模型帮忙写写使用说明、解释一下代码、修改一下现有的代码或者编写一小段代码，就能发现很多小而美的工具，告别很多枯燥的工作，甚至还能写出自己的小应用呢！ 我常用的 AI 大模型是通义千问，主要是考虑它允许的提示词长度最大，可以上传文件，免费的语音转文字，功能齐全。 但我并不是它的宣传大使，你可以根据自己的喜好选择合适的 AI 大模型。我相信，它们都能做好本文提到的这些事情。 发掘长尾工具 BrightTALK 是一个国外很流行的在线研讨会 (Webinars)...","categories": [],
        "tags": ["人工智能"],
        "url": "/2024/09/03/how-to-become-a-developer-with-ai.html",
        "teaser": null
      }]
