var store = [{
        "title": "华为的技术资料是如何打造出来的?",
        "excerpt":"昨天下午，前华为翻译中心南京分部经理、华为 2012 实验室南研分部部长张建农先生做客 2020 年中国技术传播论坛，分享了华为在技术写作和技术翻译方面的诸多实践经验，也为技术写作和技术翻译方面的从业者指明了努力方向。 技术写作和技术翻译是一个岗位吗? 在华为，这是两个彼此独立但经常通力合作的部门。 技术写作人员，又叫技术文档工程师或 Technical Writer，大多具有理工科专业背景（比如通信专业），负责撰写技术资料的中文版本或英文版本。 早年，技术写作人员归属于技术资料部，现已被分拆到各个产品线的研发团队。市场的发展与竞争，使产品研发周期从 2 年左右缩短到 1~2 个月。分拆的目的，主要是为了加强技术写作人员与研发人员的协同合作。 技术翻译人员，大多具有语言专业背景，负责将中文版的技术资料翻译成英文，或者将英文版的技术资料翻译成其他语种（120 多种语言）。 华为的技术资料一般使用中文起稿撰写，然后将中文版翻译成英文版，再由英文版翻译成其他语种。这也是目前国内厂商普遍采用的流程。 flowchart LR A(中文版)--&gt;B(英文版) B(英文版)--&gt;C(其他语种) 和技术写作团队不同，技术翻译部门在华为经历的是一个完成相反的历程。最初技术翻译人员是编制在各个产品线上的。2008 年以后，收拢成立华为翻译中心，作为独立核算的实体进行运营。 很多国外企业使用英文起稿撰写，然后将其翻译成其他语种。这种方式，显然会降低翻译成本，但对技术写作人员的要求更高。 实际上，即使采用英文起稿，这些工作也是大多交由国外的技术文档团队完成，或者公司团队中的外籍技术写作人员（成本又上去了）。 华为现在正在对这种方式进行试点，但全面实施尚有难度。 为什么不直接从中文版翻译成其他语种? 因为具备如此能力的翻译人员太难找了！ 中国学生在中学时期一般学英语。小语种专业的学生也是从大学才开始学起的。到毕业时，小语种专业的学生也只学了 4 年左右，实在难以胜任此类工作。 想想看，有多少学生学了 10 年英语还存在阅读困难的！ 工作流程是什么样的? 技术写作和技术翻译都必须遵循华为的集成产品开发流程，即 IPD 流程。 项目伊始，技术写作人员和技术翻译人员便参与到客户的需求分析流程中，从项目文件中提取相关标准、术语规范等，综合考虑华为公司标准以及相关国际标准后制定出项目标准。 技术资料的写作和翻译过程，均采用软件开发中常用的敏捷开发和迭代开发方法，小批快翻，快速迭代，快速响应，与研发进程保持同步。 对技术资料进行翻译前，必须进行原文质量检查（入口检查）。如果原文质量差，译文的质量只能更差。 检查的依据，就是项目开始时制定出的项目标准，比如 Style Guide。如果原文中存在与标准不符的地方，译员便可将其退回给原作者（技术写作人员）修改。 如果技术写作人员确实很忙，译员也会帮忙修改。但这种情况非常少见。 因为华为翻译中心是独立核算的，译员帮的忙是收费项目。被帮忙的员工要拿着收费清单，报主管批准才行（通常，主管很不乐意批这种单子）。 翻译完成的技术资料，要进行测试验证后才能发布。测试验证可以交由其他部门来做，比如研发人员、测试人员、技术写作人员。 其实这里对各个部门的人员提出了一个隐含的要求： 每个岗位的员工只掌握自己岗位的专业知识的不够的，还需要对关联岗位的专业技能也有所涉猎。...","categories": [],
        "tags": ["技术写作"],
        "url": "/2020/12/29/how-does-huawei-produce-their-technical-documentation.html",
        "teaser": null
      },{
        "title": "我的GitHub资源库：神奇的技术写作研习路",
        "excerpt":"引言      标题   标题   标题   标题      [!TIP] 这是一条提示信息。    标题   正文   标题   正文  ","categories": [],
        "tags": [],
        "url": "/2024/04/25/awesome-technical-writing-learning.html",
        "teaser": null
      }]
